# Descriptive analysis

In [ ]:
import pandas as pd

In [125]:
class DataDescriber:
    def __init__(self, filepath):
        try:
            self.df = pd.read_csv(filepath)
            self.df.set_index(self.df.columns[0], drop = True, inplace = True)
        except Exception as e:
            print('File could not be read')
            print(f'Error: {e}')

    def no_records(self):
        n = len(self.df)
        print(f'The data set has {n} rows')

    def col_types(self):
        for i in self.df.columns:
            dtype = type(self.df[i][0])
            print(f'Column {i} is of data type {dtype}')
        
    def unique_values(self):
        cols = [x for x in list(self.df.columns) if x not in ['Record_Number', 'Region']]
        for i in cols:
            vals = self.df[i].unique()
            vals.sort()
            print(f'Column {i} takes values {vals}')

    def grouped_no_records(self, col1, col2):
        grouped_mi = self.df.groupby([col1, col2])['Record_Number'].count()
        grouped_df = pd.DataFrame(grouped_mi).unstack()
        grouped_df.columns = grouped_df.columns.droplevel()
        if 'X' in grouped_df.columns:
            sorted_cols = [str(x) for x in sorted([int(x) for x in grouped_df.columns if x != 'X'])]
            sorted_cols.append('X')
        else:
            sorted_cols = sorted(grouped_df.columns)
        grouped_df = grouped_df.reindex(sorted_cols, axis = 1)
        display(grouped_df)

In [127]:
dd = DataDescriber('D:\\University\\Python for Data Analysis\\Repos\\PFDAAV\\data\\Scotland_teaching_file_1PCT_refined.csv')
dd.grouped_no_records('Hours_Worked_Per_Week', 'industry')
dd.grouped_no_records('Occupation', 'Approximate_Social_Grade')

industry,1,2,3,4,5,6,7,8,9,10,11,12,13,X
Hours_Worked_Per_Week,,,,,,,,,,,,,,
1,21.0,58.0,44.0,619.0,331.0,72.0,34.0,230.0,59.0,230.0,259.0,103.0,83.0,NaN
2,49.0,201.0,166.0,1318.0,635.0,371.0,224.0,639.0,328.0,661.0,1518.0,183.0,225.0,NaN
3,191.0,2533.0,1801.0,2255.0,738.0,1555.0,1048.0,1936.0,1592.0,1377.0,2591.0,354.0,362.0,NaN
4,258.0,559.0,427.0,411.0,230.0,432.0,117.0,425.0,130.0,253.0,184.0,57.0,60.0,NaN
X,379.0,2967.0,1438.0,2954.0,1375.0,1324.0,556.0,1588.0,1116.0,1602.0,2265.0,410.0,442.0,14435.0

Approximate_Social_Grade     1     2     3     4      X
Occupation
1                         1413  1686   213   192     46
2                         4739  1670   465   289     74
3                          933  3336   377   280     89
4                          707  3883   816   538     66
5                          218   612  4056  1176     78
6                          324   897  1530  1679     54
7                          381  1393   870  2172    118
8                           98   367  1619  2183     60
9                          247   933  1196  4675    205
X                          320   830   460  1525  11300

In [55]:
dd = DataDescriber('D:\\University\\Python for Data Analysis\\Repos\\PFDAAV\\data\\Scotland_teaching_file_1PCT_refined.csv')
dd.no_records()
dd.col_types()
dd.unique_values()

The data set has 63388 rows
Column Record_Number is of data type <class 'numpy.int64'>
Column Region is of data type <class 'str'>
Column RESIDENCE_TYPE is of data type <class 'str'>
Column Family_Composition is of data type <class 'str'>
Column sex is of data type <class 'numpy.int64'>
Column age is of data type <class 'numpy.int64'>
Column Marital_Status is of data type <class 'numpy.int64'>
Column student is of data type <class 'numpy.int64'>
Column Country_Of_Birth is of data type <class 'numpy.int64'>
Column health is of data type <class 'numpy.int64'>
Column Ethnic_Group is of data type <class 'numpy.int64'>
Column religion is of data type <class 'numpy.int64'>
Column Economic_Activity is of data type <class 'str'>
Column Occupation is of data type <class 'str'>
Column industry is of data type <class 'str'>
Column Hours_Worked_Per_Week is of data type <class 'str'>
Column Approximate_Social_Grade is of data type <class 'str'>
Column RESIDENCE_TYPE takes values ['C' 'P']
Column Family_Composition takes values ['0' '1' '2' '3' '4' '5' 'X']
Column sex takes values [1 2]
Column age takes values [1 2 3 4 5 6 7 8]
Column Marital_Status takes values [1 2 3 4 5]
Column student takes values [1 2]
Column Country_Of_Birth takes values [1 2]
Column health takes values [1 2 3 4 5]
Column Ethnic_Group takes values [1 2 3 4 5 6]
Column religion takes values [1 2 3 4 5 6 7 8 9]
Column Economic_Activity takes values ['1' '2' '3' '4' '5' '6' '7' '8' '9' 'X']
Column Occupation takes values ['1' '2' '3' '4' '5' '6' '7' '8' '9' 'X']
Column industry takes values ['1' '10' '11' '12' '13' '2' '3' '4' '5' '6' '7' '8' '9' 'X']
Column Hours_Worked_Per_Week takes values ['1' '2' '3' '4' 'X']
Column Approximate_Social_Grade takes values ['1' '2' '3' '4' 'X']